# Question 6

In [1]:
import pandas as pd

In [2]:
z = {"name": ['Chandan','Avik','Aditya','Abhishek'],
  "score": [8.0,8.4,7.9,8.9],
   'attempts': [1, 3, 2, 3],
    'qualify': ['yes', 'no', 'yes', 'no']}
pd.DataFrame(z)

       name  score  attempts qualify
0   Chandan    8.0         1     yes
1      Avik    8.4         3      no
2    Aditya    7.9         2     yes
3  Abhishek    8.9         3      no

# Question 7

In [3]:
z = {"name": ['Chandan','Avik','Aditya','Abhishek'],
  "score": [8.0,8.4,7.9,8.9],
   'attempts': [1, 3, 2, 3],
    'qualify': ['yes', 'no', 'yes', 'no']}
y=pd.DataFrame(z)

print("Select specific columns:")
print(y[['name', 'score']])

Select specific columns:
       name  score
0   Chandan    8.0
1      Avik    8.4
2    Aditya    7.9
3  Abhishek    8.9

# Question 8

In [12]:
stud_data1=pd.DataFrame({'student id':['S1','S2','S3','S4'],
                           'name':['Abhishek','Aditya','Avik','Chandan'],
                           'marks':[200, 210, 190, 222]})

stud_data2=pd.DataFrame({'student id': ['S5', 'S6', 'S7', 'S8'],
         'name': ['Luice','Man','Alex','Jack'],
        'marks': [300, 100, 187, 268]})

print("Original DataFrame")
print(stud_data1)
print("-------------------------------------")
print(stud_data2)
print("-------------------------------------")
print("\nJoining the said two dataframes along rows:")
result_data = pd.concat([stud_data1, stud_data2])
print(result_data)

Original DataFrame
  student id      name  marks
0         S1  Abhishek    200
1         S2    Aditya    210
2         S3      Avik    190
3         S4   Chandan    222
-------------------------------------
  student id   name  marks
0         S5  Luice    300
1         S6    Man    100
2         S7   Alex    187
3         S8   Jack    268
-------------------------------------

Joining the said two dataframes along rows:
  student id      name  marks
0         S1  Abhishek    200
1         S2    Aditya    210
2         S3      Avik    190
3         S4   Chandan    222
0         S5     Luice    300
1         S6       Man    100
2         S7      Alex    187
3         S8      Jack    268

# Question 9

In [18]:
data = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, 45, 56, np.nan], 
        'Third Score':[np.nan, 40, 80, 98]} 

df=pd.DataFrame(data)
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

# Question 10

In [22]:
import numpy as np
data2=np.array(['mango','orange','apple','kivi'])

ex=pd.Series(data2)
ex

0     mango
1    orange
2     apple
3      kivi
dtype: object